MindScienceSkills/fluid_dynamics/fluid_dynamics/hpc-openfoam/assets/templates/simplefoam-laminar/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
    }
}

// ************************************************************************* //
// NOTE: If enabling RAS turbulence, uncomment and extend the turbulence
// solver block below.  Typical pattern for kEpsilon:
//
// --- uncomment for RAS turbulence ---
// solvers
// {
//     p
//     {
//         solver          GAMG;
//         tolerance       1e-8;
//         relTol          0.1;
//         smoother        GaussSeidel;
//     }
//
//     U
//     {
//         solver          smoothSolver;
//         smoother        symGaussSeidel;
//         tolerance       1e-8;
//         relTol          0.1;
//     }
//
//     k
//     {
//         solver          PBiCGStab;
//         preconditioner  DIC;
//         tolerance       1e-8;
//         relTol          0.1;
//     }
//
//     epsilon
//     {
//         solver          PBiCGStab;
//         preconditioner  DIC;
//         tolerance       1e-8;
//         relTol          0.1;
//     }
//
//     nut
//     {
//         solver          diffusion;
//         tolerance       1e-8;
//         relTol          0;
//     }
// }
// --- end RAS turbulence block ---
